In [2]:
#Series和DataFrame的連結

In [3]:
#1:38:20~1:41:00觀念講解 ~ 1:42:30
import numpy as np
import pandas as pd

s1 = pd.Series([0,1], index=['a','b'])
display(s1)
s2 = pd.Series([2, 3, 4], index=['c', 'd', 'e'])
display(s2)
s3 = pd.Series([5,6], index=['f','g'])
display(s3)

a    0
b    1
dtype: int64

c    2
d    3
e    4
dtype: int64

f    5
g    6
dtype: int64

In [4]:
#1:42:30
pd.concat([s1,s2,s3])

a    0
b    1
c    2
d    3
e    4
f    5
g    6
dtype: int64

In [5]:
#1:43:50~1:44:45
pd.concat([s1,s2,s3],axis=1)  #由欄(橫的)做連接

     0    1    2
a  0.0  NaN  NaN
b  1.0  NaN  NaN
c  NaN  2.0  NaN
d  NaN  3.0  NaN
e  NaN  4.0  NaN
f  NaN  NaN  5.0
g  NaN  NaN  6.0

In [6]:
#1:47:45
df1 = pd.DataFrame(np.arange(6).reshape(3, 2),
                   index=['a', 'b', 'c'],
                   columns=['one','two'])
display(df1)
df2 = pd.DataFrame(np.arange(4).reshape(2, 2),
                   index=['a', 'c'],
                   columns=['three','four'])
display(df2)

   one  two
a    0    1
b    2    3
c    4    5

   three  four
a      0     1
c      2     3

In [7]:
pd.concat([df1, df2],axis=1)

   one  two  three  four
a    0    1    0.0   1.0
b    2    3    NaN   NaN
c    4    5    2.0   3.0

In [8]:
pd.concat([df1, df2],axis=1,keys=['台北','台南'])

   台北        台南
  one two three four
a   0   1   0.0  1.0
b   2   3   NaN  NaN
c   4   5   2.0  3.0